<a href="http://www.cear.ufpb.br/pet">
    <img src="../images/pandas_logo.png" width="180px" align="left">
</a>
<a href="http://www.cear.ufpb.br/pet">
    <img src="../images/logo_pet.png" width="150px" align="right">
</a>

<h1 align="center" style="color:blue" >Biblioteca Pandas em Python</h1>

<hr width="50%" align="center">

<h2 align="left" style="color:blue" >
    Essa biblioteca é a porta de entrada para os estudos que envolvem a Ciência de Dados. 
</h2>


<h3 align="left" style="color:blue" >
 Permite ler, manipular, agregar e plotar os dados em poucos passos.   
</h3>
<hr align="left" width="200px">

<h3 align="left" style="color:blue" >
    A biblioteca fornece duas maneiras de estruturar os nossos dados:
<h3>
<hr align="left" width="200px">

> O __DataFrame__ que possui uma estrutura tabular de N-dimensões, se assemelha a uma tabela no excel, onde seus itens são endereçados segundo linhas e colunas.

> A __Series__ que é uma matriz unidimensional que contém uma sequencia de valores acompanhado de seus respectivos índices.

Vamos observar cada uma delas.

<h3 align="left" style="color:blue" >
    Importando bibliotecas
<h3>
<hr align="left" width="200px">

In [1]:
import pandas as pd
import numpy as np

<h3 align="left" style="color:blue" >
   Criando series
<h3>
<hr align="left" width="200px">

In [ ]:
np.arange(4)*10

In [ ]:
labels = ["A","B","C","D"]
array = np.arange(4)*10
labels

In [ ]:
pd.Series(data =array, index = labels )

In [ ]:
lista = ["Minicurso","Python","Online","Pandas"]
pd.Series(data =lista, index = labels )

__Caso não declarado o indice é gerado automaticamente seguindo a ordem crescente__

In [ ]:
pd.Series(data = lista)

In [ ]:
d = {"A":"Amor","B":"Baixinho"}
pd.Series(d)

In [ ]:
pd.Series({"C":"caixa", "D":"dado"})

__Uma series pode conter diferentes ditos de elementos__

In [ ]:
Serie = pd.Series({"City":'João Pessoa',"Pop": 800.323,"Seadside": True})
Serie2 = pd.Series({"City":'Sousa',"Seadside": False,"Pop": 69.723})
print(Serie)
print( )
print(Serie2)

__Duas series soman-se indice a indice, mesmo que estejam desordenados__

In [ ]:
Serie + Serie2

In [ ]:
itens1 = pd.Series(data = [2,3,6,4], index = ["Arroz","Feijão","Queijo","Tapioca"])
itens2 = pd.Series(data = [9,1,7,3], index = ["Queijo","Feijão","Tapioca","Pão"])
print(itens1)
print()
print(itens2)

__Caso não encontrado o indice é retornado "nan"__

In [ ]:
itens1+itens2

<h3 align="left" style="color:blue" >
   Criando Dataframes
<h3>
<hr align="left" width="200px">

In [ ]:
df = pd.DataFrame(data = np.arange(1,25).reshape(6,4), index = 'P A N D A S'.split(), columns =['A','B','C','D'] )
df

__Quando um dicionanrio é utilizado nesse caso as chaves tornam - se colunas__

In [ ]:
Dict = { "X" :[0.1,3.2,4.5], "Y" :[2.4,5.6,2.2]}

In [ ]:
df = pd.DataFrame(data = Dict)
df

<h3 align="left" style="color:blue" >
   Operações
<h3>
<hr align="left" width="200px">

In [ ]:
df = pd.DataFrame({'col1': [4,3,2,1,0],'col2': [278,999,555,278,555],'col3':['def','ghi','jkl','mno','abc']})
df

In [ ]:
df['col2']

In [ ]:
#retorna uma lista que contém os valores da coluna sem repetição
df['col2'].unique()

In [ ]:
df['col2'].nunique()

In [ ]:
df['col2'].value_counts()

In [ ]:
df['col1'].sum()

In [ ]:
df['col1'].max()

In [ ]:
def vezes2(x):
    return x*2

In [ ]:
df['col1'].apply(vezes2)

In [ ]:
df

In [ ]:
df['col1'] = df['col1'].apply(vezes2)
df

In [ ]:
df['col2'].apply(lambda x: x-100)

In [ ]:
df[['col1','col2']]

In [ ]:
df[['col1','col2']] < 70

In [ ]:
df

In [ ]:
df['col1']<7

In [ ]:
df['col1'][df['col1']<7]

In [ ]:
df[df['col1']<7]

In [ ]:
ex = pd.DataFrame({'temperatura': [25,20,20,19,28],'pluviosidade': [278,102,60,208,500],'dia':['segunda','terça','quarta','quinta','sexta']})
ex

In [ ]:
ex[ex['temperatura']<25]

In [ ]:
ex[(ex['temperatura'] < 25) & (ex['dia'] == 'quarta')]

In [ ]:
ex[(ex['temperatura'] >= 25) | (ex['pluviosidade'] > 200)]

In [ ]:
ex['HOJE'] = ['t','u','v','w','x']
ex

In [ ]:
del(ex['new'])
ex

In [ ]:
df

In [ ]:
df.sort_values(by='col2')

In [ ]:
df.sort_values(by = 'col1')

In [ ]:
df.sort_values(by = 'col3')

In [ ]:
df.sort_values(by = 'col2', ascending = False)

In [ ]:
df

In [ ]:
df[df['col1']>2]

In [ ]:
df['col1']>2

In [ ]:
df.where(df['col1']>2,other = 'não satisfeito')

In [ ]:
df.mask(df['col1']>2, other = df['col1'].mean())

<h3 align="left" style="color:blue" >
   Seccionamento dos dados
<h3>
<hr align="left" width="200px">

In [2]:
names = ['Marcos','Tiago','Felipe','Rafael','Marcos','João','Tiago','Miguel','Marcos','Rafael','João','Felipe']

In [3]:
vendas = pd.DataFrame({"Responsável": names, "Valor": np.random.rand(12)*1000,"Data": ["2020-3-5","2020-3-12","2020-3-15","2020-3-7","2020-3-30","2020-3-26","2020-3-7","2020-3-19","2020-3-5","2020-3-19","2020-3-17","2020-3-14"],"itens": np.random.randint(1,5,size = (12))})
vendas

   Responsável       Valor       Data  itens
0       Marcos  299.426608   2020-3-5      2
1        Tiago  139.009732  2020-3-12      3
2       Felipe  891.567287  2020-3-15      4
3       Rafael  368.193547   2020-3-7      4
4       Marcos  194.295484  2020-3-30      4
5         João  582.175450  2020-3-26      4
6        Tiago  973.123116   2020-3-7      3
7       Miguel  571.521176  2020-3-19      3
8       Marcos  720.164191   2020-3-5      2
9       Rafael  136.410048  2020-3-19      3
10        João  311.935692  2020-3-17      2
11      Felipe  893.585177  2020-3-14      1

In [4]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Responsável  12 non-null     object
 1   Valor        12 non-null     float64
 2   Data         12 non-null     object
 3   itens        12 non-null     int32
dtypes: float64(1), int32(1), object(2)
memory usage: 464.0+ bytes

In [5]:
vendas["Data"] = pd.to_datetime(vendas["Data"])
vendas["Responsável"] = vendas['Responsável'].convert_dtypes(convert_string=True)

In [6]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Responsável  12 non-null     string
 1   Valor        12 non-null     float64
 2   Data         12 non-null     datetime64[ns]
 3   itens        12 non-null     int32
dtypes: datetime64[ns](1), float64(1), int32(1), string(1)
memory usage: 464.0 bytes

In [7]:
vendas["Dia"] = vendas["Data"].dt.day_name()

In [8]:
vendas

   Responsável       Valor       Data  itens       Dia
0       Marcos  299.426608 2020-03-05      2  Thursday
1        Tiago  139.009732 2020-03-12      3  Thursday
2       Felipe  891.567287 2020-03-15      4    Sunday
3       Rafael  368.193547 2020-03-07      4  Saturday
4       Marcos  194.295484 2020-03-30      4    Monday
5         João  582.175450 2020-03-26      4  Thursday
6        Tiago  973.123116 2020-03-07      3  Saturday
7       Miguel  571.521176 2020-03-19      3  Thursday
8       Marcos  720.164191 2020-03-05      2  Thursday
9       Rafael  136.410048 2020-03-19      3  Thursday
10        João  311.935692 2020-03-17      2   Tuesday
11      Felipe  893.585177 2020-03-14      1  Saturday

In [10]:
#Uma linha inteira
vendas.iloc[2]

Responsável                 Felipe
Valor                   891.567287
Data           2020-03-15 00:00:00
itens                            4
Dia                         Sunday
Name: 2, dtype: object

In [14]:
vendas.iloc[0,3]

2

In [17]:
#Uma coluna inteira
vendas.iloc[:,0]

0     Marcos
1      Tiago
2     Felipe
3     Rafael
4     Marcos
5       João
6      Tiago
7     Miguel
8     Marcos
9     Rafael
10      João
11    Felipe
Name: Responsável, dtype: string

In [19]:
vendas

   Responsável       Valor       Data  itens       Dia
0       Marcos  299.426608 2020-03-05      2  Thursday
1        Tiago  139.009732 2020-03-12      3  Thursday
2       Felipe  891.567287 2020-03-15      4    Sunday
3       Rafael  368.193547 2020-03-07      4  Saturday
4       Marcos  194.295484 2020-03-30      4    Monday
5         João  582.175450 2020-03-26      4  Thursday
6        Tiago  973.123116 2020-03-07      3  Saturday
7       Miguel  571.521176 2020-03-19      3  Thursday
8       Marcos  720.164191 2020-03-05      2  Thursday
9       Rafael  136.410048 2020-03-19      3  Thursday
10        João  311.935692 2020-03-17      2   Tuesday
11      Felipe  893.585177 2020-03-14      1  Saturday

In [18]:
vendas.iloc[:3,0]

0    Marcos
1     Tiago
2    Felipe
Name: Responsável, dtype: string

In [21]:
vendas.iloc[:3,:2]

  Responsável       Valor
0      Marcos  299.426608
1       Tiago  139.009732
2      Felipe  891.567287

In [20]:
vendas.iloc[0:5,2:]

        Data  itens       Dia
0 2020-03-05      2  Thursday
1 2020-03-12      3  Thursday
2 2020-03-15      4    Sunday
3 2020-03-07      4  Saturday
4 2020-03-30      4    Monday

In [24]:
vendas.iloc[[1,5,6],[0,3]]

  Responsável  itens
1       Tiago      3
5        João      4
6       Tiago      3

In [27]:
vendas.loc[0]

Responsável                 Marcos
Valor                   299.426608
Data           2020-03-05 00:00:00
itens                            2
Dia                       Thursday
Name: 0, dtype: object

In [30]:
vendas.loc[2,"Dia"]

'Sunday'

<h3 align="left" style="color:blue" >
   Método Groupby()
<h3>
<hr align="left" width="200px">
    
__Esse metodo permite agupar os dados segundo o parâmetro colocado e em seguida realizar algumas operações__

In [34]:
vendas

   Responsável       Valor       Data  itens       Dia
0       Marcos  299.426608 2020-03-05      2  Thursday
1        Tiago  139.009732 2020-03-12      3  Thursday
2       Felipe  891.567287 2020-03-15      4    Sunday
3       Rafael  368.193547 2020-03-07      4  Saturday
4       Marcos  194.295484 2020-03-30      4    Monday
5         João  582.175450 2020-03-26      4  Thursday
6        Tiago  973.123116 2020-03-07      3  Saturday
7       Miguel  571.521176 2020-03-19      3  Thursday
8       Marcos  720.164191 2020-03-05      2  Thursday
9       Rafael  136.410048 2020-03-19      3  Thursday
10        João  311.935692 2020-03-17      2   Tuesday
11      Felipe  893.585177 2020-03-14      1  Saturday

In [32]:
grupoDia = vendas.groupby(vendas['Dia'])

In [33]:
grupoDia.sum()

                Valor  itens
Dia
Monday     194.295484      4
Saturday  2234.901840      8
Sunday     891.567287      4
Thursday  2448.707206     17
Tuesday    311.935692      2

In [35]:
vendas.groupby(vendas['Responsável']).sum()

                   Valor  itens
Responsável
Felipe       1785.152465      5
João          894.111142      6
Marcos       1213.886284      8
Miguel        571.521176      3
Rafael        504.603596      7
Tiago        1112.132848      6

In [36]:
vendas.groupby(vendas['Responsável']).describe()

            Valor                                                              \
            count        mean         std         min         25%         50%
Responsável
Felipe        2.0  892.576232    1.426864  891.567287  892.071760  892.576232
João          2.0  447.055571  191.088365  311.935692  379.495631  447.055571
Marcos        3.0  404.628761  278.271619  194.295484  246.861046  299.426608
Miguel        1.0  571.521176         NaN  571.521176  571.521176  571.521176
Rafael        2.0  252.301798  163.895684  136.410048  194.355923  252.301798
Tiago         2.0  556.066424  589.807230  139.009732  347.538078  556.066424

                                    itens                                      \
                    75%         max count      mean       std  min   25%  50%
Responsável
Felipe       893.080705  893.585177   2.0  2.500000  2.121320  1.0  1.75  2.5
João         514.615510  582.175450   2.0  3.000000  1.414214  2.0  2.50  3.0
Marcos       509.795400  720.164191   3.0  2.666667  1.154701  2.0  2.00  2.0
Miguel       571.521176  571.521176   1.0  3.000000       NaN  3.0  3.00  3.0
Rafael       310.247673  368.193547   2.0  3.500000  0.707107  3.0  3.25  3.5
Tiago        764.594770  973.123116   2.0  3.000000  0.000000  3.0  3.00  3.0


              75%  max
Responsável
Felipe       3.25  4.0
João         3.50  4.0
Marcos       3.00  4.0
Miguel       3.00  3.0
Rafael       3.75  4.0
Tiago        3.00  3.0

In [37]:
vendas['Data'].dt.day

0      5
1     12
2     15
3      7
4     30
5     26
6      7
7     19
8      5
9     19
10    17
11    14
Name: Data, dtype: int64

In [38]:
vendas.groupby(vendas['Data'].dt.day)

In [39]:
vendas.groupby(vendas['Data'].dt.day).sum()

            Valor  itens
Data
5     1019.590799      4
7     1341.316663      7
12     139.009732      3
14     893.585177      1
15     891.567287      4
17     311.935692      2
19     707.931224      6
26     582.175450      4
30     194.295484      4

<h3 align="left" style="color:blue" >
   Lidando com dados ausentes
<h3>
<hr align="left" width="200px">

In [40]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [41]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [42]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [44]:
df.dropna(axis = 0,thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [45]:
df.fillna(value='vazio')

       A      B  C
0    1.0    5.0  1
1    2.0  vazio  2
2  vazio  vazio  3

In [46]:
df.fillna(value = df['C'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

<h3 align="left" style="color:blue" >
   Combinando Dataframes
<h3>
<hr align="left" width="200px">

* Merge
* Join 
* Concat

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

### __Concatenar__
- Une os dataframes um abaixo do outro ou a direita do outro, para isso é importante que o número de colunas e/ou linhas sejam iguais

In [ ]:
pd.concat([df1,df2,df3])

In [ ]:
pd.concat([df1,df2,df3],axis = 1)

In [ ]:
df2.reset_index(drop = True)

In [ ]:
pd.concat([df1,df2.reset_index(drop = True),df3.reset_index(drop = True)],axis = 1)

### __Mesclar__
- Esse método te permite unir 2 dataframes apartir de algo em comun.

In [ ]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
esquerda

In [ ]:
direita

In [ ]:
pd.merge(esquerda,direita,on='key')

In [ ]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
esquerda

In [ ]:
direita

In [ ]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

### __Juntar__
- Esse método te permite unir dataframes com segundo os indices

In [ ]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
esquerda

In [ ]:
direita

A partir do índices da esquerda une os valores de direita com os indices correspondentes

In [ ]:
esquerda.join(direita)

Com o parametro 'outer' o join usa todos os indices encontrados em ambos os dataframes e preenche de acordo

In [ ]:
esquerda.join(direita, how='outer')

<h3 align="left" style="color:blue" >
   Ler e exportar dados tabulados
<h3>
<hr align="left" width="200px">

o método "read_" permite que importemos dados de diversos tipos
https://pandas.pydata.org/pandas-docs/stable/search.html?q=pandas.read_

### _Csv_

In [54]:
# o mais comun dos tipos de estruturação de dados usado é o csv (comma separate values)
exemplo_csv =pd.read_csv('../datasets/Exemplo-csv.csv',index_col = 0, header = 0, sep = ",")
exemplo_csv

         0       1          2         3
A    Alice   Anita        Ana    Arthur
B  Beatriz   Bruno     Bianca  Benjamin
C     Caio  Camila    Cecilia  Catarina
D   Daniel    Davi  Dominique  Doralice

In [ ]:
exemplo_csv.to_csv('exemplo_csv',sep = ';')

### _Excel_

In [55]:
exemplo_excel = pd.read_excel('../datasets/Exemplo-Excel.xlsx',index_col= 0)
exemplo_excel

         0       1          2         3
A    Alice   Anita        Ana    Arthur
B  Beatriz   Bruno     Bianca  Benjamin
C     Caio  Camila    Cecilia  Catarina
D   Daniel    Davi  Dominique  Doralice

In [ ]:
exemplo_excel.to_excel('exemplo.xlsx')

### _HTML_

In [56]:
import html5lib
import lxml
from bs4 import BeautifulSoup

In [57]:
exemplo_html = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
exemplo_html

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [58]:
type(exemplo_html)

list

In [59]:
len(exemplo_html)

1

In [61]:
exemplo_html[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [ ]:
exemplo_html[0].to_html('exemplo.html')

<h1 align="left" style="color:blue" >
   FIM 
<h1>

<div>
    <a href="https://www.ufpb.br/">
        <img src="../images/logo_ufpb.png" align="left" height="50px" width="70px">
    </a>
    <a href="http://www.cear.ufpb.br/">
        <img src="../images/logo_cear.png" align="left" width="95px">
    </a>
</div>